# Brewfile for Jesse's MacBook

# Essential Tools
brew 'git'
brew 'wget'

# Development Tools
cask 'visual-studio-code'
cask 'iterm2'

# Entertainment
cask 'spotify'

# Productivity
cask 'spectacle'

# Additional Applications
cask 'google-chrome'         # Web browser
cask 'slack'                 # Communication tool
cask 'zoom'                # Video conferencing
cask 'microsoft-office'      # Office suite (Word, Excel, PowerPoint)
cask 'alfred'                # Productivity booster
cask '1password'             # Password manager
cask 'notion'                # Note-taking and collaboration
cask 'postman'               # API testing tool
cask 'docker'                # Containerization platform
cask 'figma'                 # Design collaboration tool
cask 'wechat'                # WeChat
cask 'karabiner-elements'    # Karabiner Elements - keyboarrd remapper
cask 'logi-options-plus'     # Logitech options software for peripherals
cask 'todoist'               # Todo list

# Feel free to add or remove any other applications as needed

# To install these applications, run:
# brew bundle install
